teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/UAC_HID/UAC_HID_API.c
    if (i32Ret == E_SUCCESS)
    {
        /* Install the USB event handler to USB event callback */       
        i32Ret = USBD_Open((void *)USBD_DispatchEvent);
        HID_SetReportDescriptor(g_HID_au8KeyboardReportDescriptor, g_HID_u32KeyboardReportDescriptorSize);
        
        /* Set the HID report buffer */
        HID_SetReportBuf(g_au8KeyboardReport, g_u32KeyboardReportSize);
        UAC_Open((void *)HID_GetInReport);
        
               
        /* If the USB has been attached already, we should force the bus reset. */
        eUsbState = USBD_GetUsbState();
        if (eUsbState >= eUSBD_ATTACHED)
        {
            /* Force Bus Reset for 150 ms*/
            _USBD_ENABLE_SE0();
            SYS_SysTickDelay(150000);
            _USBD_DISABLE_SE0();
        }
                    
        // Disable USB-related interrupts.
        _USBD_ENABLE_MISC_INT(0);

        // Enable float-detection interrupt.
        _USBD_ENABLE_FLDET_INT();
        
        _USBD_ENABLE_MISC_INT(INTEN_WAKEUP | INTEN_WAKEUPEN | INTEN_FLDET | INTEN_USB | INTEN_BUS);
 
        while(1)
        {      

            eUsbState = USBD_GetUsbState();
            
            if (eUsbState == eUSBD_DETACHED)
            {
                /* Just waiting for USB attach */
                while (eUsbState == eUSBD_DETACHED)
                {
                    eUsbState = USBD_GetUsbState();
                }
            }
        }
    }
    
    return 0;
}

void HID_GetInReport(uint8_t *buf)
{
    int32_t i;
    uint32_t key;
    
    key = PA->PIN;
    {
        /* No any key pressed */
        if (((key >> 3) & 0xF) == 0xF)
        {
            for(i=0;i<8;i++)
            {
                buf[i] = 0;
            }
        }
        
        /* Key A (GPIOA3) Pressed */
        if ((key & (1<<3)) == 0)
        {
            buf[2] = 0x04; /* a */
        }
        
        /* Key B (GPIOA4) Pressed */
        if ((key & (1<<4)) == 0)
        {
            buf[2] = 0x05; /* b */   
        }
        
        /* Key C (GPIOA5) Pressed */
        if ((key & (1<<5)) == 0)
        {
            buf[2] = 0x06; /* c */ 
        }
        
        /* Key D (GPIOA6) Pressed */
        if ((key & (1<<6)) == 0)
        {
            /* abc */
            buf[2] = 0x04;
            buf[3] = 0x05;
            buf[4] = 0x06;
        }
    }
}

